GopalSaraf/Practicals/PSDL/include/proc/pic16lf1578.inc
// Register: PWM1OFH
#define PWM1OFH PWM1OFH
PWM1OFH                                  equ 0D98h
// bitfield definitions
PWM1OFH_OF_POSN                          equ 0000h
PWM1OFH_OF_POSITION                      equ 0000h
PWM1OFH_OF_SIZE                          equ 0008h
PWM1OFH_OF_LENGTH                        equ 0008h
PWM1OFH_OF_MASK                          equ 00FFh
PWM1OFH_PWM1OFH0_POSN                    equ 0000h
PWM1OFH_PWM1OFH0_POSITION                equ 0000h
PWM1OFH_PWM1OFH0_SIZE                    equ 0001h
PWM1OFH_PWM1OFH0_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH0_MASK                    equ 0001h
PWM1OFH_PWM1OFH1_POSN                    equ 0001h
PWM1OFH_PWM1OFH1_POSITION                equ 0001h
PWM1OFH_PWM1OFH1_SIZE                    equ 0001h
PWM1OFH_PWM1OFH1_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH1_MASK                    equ 0002h
PWM1OFH_PWM1OFH2_POSN                    equ 0002h
PWM1OFH_PWM1OFH2_POSITION                equ 0002h
PWM1OFH_PWM1OFH2_SIZE                    equ 0001h
PWM1OFH_PWM1OFH2_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH2_MASK                    equ 0004h
PWM1OFH_PWM1OFH3_POSN                    equ 0003h
PWM1OFH_PWM1OFH3_POSITION                equ 0003h
PWM1OFH_PWM1OFH3_SIZE                    equ 0001h
PWM1OFH_PWM1OFH3_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH3_MASK                    equ 0008h
PWM1OFH_PWM1OFH4_POSN                    equ 0004h
PWM1OFH_PWM1OFH4_POSITION                equ 0004h
PWM1OFH_PWM1OFH4_SIZE                    equ 0001h
PWM1OFH_PWM1OFH4_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH4_MASK                    equ 0010h
PWM1OFH_PWM1OFH5_POSN                    equ 0005h
PWM1OFH_PWM1OFH5_POSITION                equ 0005h
PWM1OFH_PWM1OFH5_SIZE                    equ 0001h
PWM1OFH_PWM1OFH5_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH5_MASK                    equ 0020h
PWM1OFH_PWM1OFH6_POSN                    equ 0006h
PWM1OFH_PWM1OFH6_POSITION                equ 0006h
PWM1OFH_PWM1OFH6_SIZE                    equ 0001h
PWM1OFH_PWM1OFH6_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH6_MASK                    equ 0040h
PWM1OFH_PWM1OFH7_POSN                    equ 0007h
PWM1OFH_PWM1OFH7_POSITION                equ 0007h
PWM1OFH_PWM1OFH7_SIZE                    equ 0001h
PWM1OFH_PWM1OFH7_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH7_MASK                    equ 0080h
PWM1OFH_PWM1OFH_POSN                     equ 0000h
PWM1OFH_PWM1OFH_POSITION                 equ 0000h
PWM1OFH_PWM1OFH_SIZE                     equ 0008h
PWM1OFH_PWM1OFH_LENGTH                   equ 0008h
PWM1OFH_PWM1OFH_MASK                     equ 00FFh

// Register: PWM1TMRL
#define PWM1TMRL PWM1TMRL
PWM1TMRL                                 equ 0D99h
// bitfield definitions
PWM1TMRL_TMR_POSN                        equ 0000h
PWM1TMRL_TMR_POSITION                    equ 0000h
PWM1TMRL_TMR_SIZE                        equ 0008h
PWM1TMRL_TMR_LENGTH                      equ 0008h
PWM1TMRL_TMR_MASK                        equ 00FFh
PWM1TMRL_PWM1TMRL0_POSN                  equ 0000h
PWM1TMRL_PWM1TMRL0_POSITION              equ 0000h
PWM1TMRL_PWM1TMRL0_SIZE                  equ 0001h
PWM1TMRL_PWM1TMRL0_LENGTH                equ 0001h
PWM1TMRL_PWM1TMRL0_MASK                  equ 0001h
PWM1TMRL_PWM1TMRL1_POSN                  equ 0001h
PWM1TMRL_PWM1TMRL1_POSITION              equ 0001h
PWM1TMRL_PWM1TMRL1_SIZE                  equ 0001h
PWM1TMRL_PWM1TMRL1_LENGTH                equ 0001h
PWM1TMRL_PWM1TMRL1_MASK                  equ 0002h
PWM1TMRL_PWM1TMRL2_POSN                  equ 0002h
PWM1TMRL_PWM1TMRL2_POSITION              equ 0002h
PWM1TMRL_PWM1TMRL2_SIZE                  equ 0001h
PWM1TMRL_PWM1TMRL2_LENGTH                equ 0001h
PWM1TMRL_PWM1TMRL2_MASK                  equ 0004h
PWM1TMRL_PWM1TMRL3_POSN                  equ 0003h
PWM1TMRL_PWM1TMRL3_POSITION              equ 0003h
PWM1TMRL_PWM1TMRL3_SIZE                  equ 0001h
PWM1TMRL_PWM1TMRL3_LENGTH                equ 0001h
PWM1TMRL_PWM1TMRL3_MASK                  equ 0008h
PWM1TMRL_PWM1TMRL4_POSN                  equ 0004h
PWM1TMRL_PWM1TMRL4_POSITION              equ 0004h
PWM1TMRL_PWM1TMRL4_SIZE                  equ 0001h
PWM1TMRL_PWM1TMRL4_LENGTH                equ 0001h
PWM1TMRL_PWM1TMRL4_MASK                  equ 0010h
PWM1TMRL_PWM1TMRL5_POSN                  equ 0005h
PWM1TMRL_PWM1TMRL5_POSITION              equ 0005h
PWM1TMRL_PWM1TMRL5_SIZE                  equ 0001h
PWM1TMRL_PWM1TMRL5_LENGTH                equ 0001h
PWM1TMRL_PWM1TMRL5_MASK                  equ 0020h
PWM1TMRL_PWM1TMRL6_POSN                  equ 0006h
PWM1TMRL_PWM1TMRL6_POSITION              equ 0006h
PWM1TMRL_PWM1TMRL6_SIZE                  equ 0001h
PWM1TMRL_PWM1TMRL6_LENGTH                equ 0001h
PWM1TMRL_PWM1TMRL6_MASK                  equ 0040h
PWM1TMRL_PWM1TMRL7_POSN                  equ 0007h
PWM1TMRL_PWM1TMRL7_POSITION              equ 0007h
PWM1TMRL_PWM1TMRL7_SIZE                  equ 0001h
PWM1TMRL_PWM1TMRL7_LENGTH                equ 0001h
PWM1TMRL_PWM1TMRL7_MASK                  equ 0080h
PWM1TMRL_PWM1TMRL_POSN                   equ 0000h
PWM1TMRL_PWM1TMRL_POSITION               equ 0000h
PWM1TMRL_PWM1TMRL_SIZE                   equ 0008h
PWM1TMRL_PWM1TMRL_LENGTH                 equ 0008h
PWM1TMRL_PWM1TMRL_MASK                   equ 00FFh

// Register: PWM1TMRH
#define PWM1TMRH PWM1TMRH
PWM1TMRH                                 equ 0D9Ah
// bitfield definitions
PWM1TMRH_TMR_POSN                        equ 0000h
PWM1TMRH_TMR_POSITION                    equ 0000h
PWM1TMRH_TMR_SIZE                        equ 0008h
PWM1TMRH_TMR_LENGTH                      equ 0008h
PWM1TMRH_TMR_MASK                        equ 00FFh
PWM1TMRH_PWM1TMRH0_POSN                  equ 0000h
PWM1TMRH_PWM1TMRH0_POSITION              equ 0000h
PWM1TMRH_PWM1TMRH0_SIZE                  equ 0001h
PWM1TMRH_PWM1TMRH0_LENGTH                equ 0001h
PWM1TMRH_PWM1TMRH0_MASK                  equ 0001h
PWM1TMRH_PWM1TMRH1_POSN                  equ 0001h
PWM1TMRH_PWM1TMRH1_POSITION              equ 0001h
PWM1TMRH_PWM1TMRH1_SIZE                  equ 0001h
PWM1TMRH_PWM1TMRH1_LENGTH                equ 0001h
PWM1TMRH_PWM1TMRH1_MASK                  equ 0002h
PWM1TMRH_PWM1TMRH2_POSN                  equ 0002h
PWM1TMRH_PWM1TMRH2_POSITION              equ 0002h
PWM1TMRH_PWM1TMRH2_SIZE                  equ 0001h
PWM1TMRH_PWM1TMRH2_LENGTH                equ 0001h
PWM1TMRH_PWM1TMRH2_MASK                  equ 0004h
PWM1TMRH_PWM1TMRH3_POSN                  equ 0003h
PWM1TMRH_PWM1TMRH3_POSITION              equ 0003h
PWM1TMRH_PWM1TMRH3_SIZE                  equ 0001h
PWM1TMRH_PWM1TMRH3_LENGTH                equ 0001h
PWM1TMRH_PWM1TMRH3_MASK                  equ 0008h
PWM1TMRH_PWM1TMRH4_POSN                  equ 0004h
PWM1TMRH_PWM1TMRH4_POSITION              equ 0004h
PWM1TMRH_PWM1TMRH4_SIZE                  equ 0001h
PWM1TMRH_PWM1TMRH4_LENGTH                equ 0001h
PWM1TMRH_PWM1TMRH4_MASK                  equ 0010h
PWM1TMRH_PWM1TMRH5_POSN                  equ 0005h
PWM1TMRH_PWM1TMRH5_POSITION              equ 0005h
PWM1TMRH_PWM1TMRH5_SIZE                  equ 0001h
PWM1TMRH_PWM1TMRH5_LENGTH                equ 0001h
PWM1TMRH_PWM1TMRH5_MASK                  equ 0020h
PWM1TMRH_PWM1TMRH6_POSN                  equ 0006h
PWM1TMRH_PWM1TMRH6_POSITION              equ 0006h
PWM1TMRH_PWM1TMRH6_SIZE                  equ 0001h
PWM1TMRH_PWM1TMRH6_LENGTH                equ 0001h
PWM1TMRH_PWM1TMRH6_MASK                  equ 0040h
PWM1TMRH_PWM1TMRH7_POSN                  equ 0007h
PWM1TMRH_PWM1TMRH7_POSITION              equ 0007h
PWM1TMRH_PWM1TMRH7_SIZE                  equ 0001h
PWM1TMRH_PWM1TMRH7_LENGTH                equ 0001h
PWM1TMRH_PWM1TMRH7_MASK                  equ 0080h
PWM1TMRH_PWM1TMRH_POSN                   equ 0000h
PWM1TMRH_PWM1TMRH_POSITION               equ 0000h
PWM1TMRH_PWM1TMRH_SIZE                   equ 0008h
PWM1TMRH_PWM1TMRH_LENGTH                 equ 0008h
PWM1TMRH_PWM1TMRH_MASK                   equ 00FFh

// Register: PWM1CON
#define PWM1CON PWM1CON
PWM1CON                                  equ 0D9Bh
// bitfield definitions
PWM1CON_MODE_POSN                        equ 0002h
PWM1CON_MODE_POSITION                    equ 0002h
PWM1CON_MODE_SIZE                        equ 0002h
PWM1CON_MODE_LENGTH                      equ 0002h
PWM1CON_MODE_MASK                        equ 000Ch
PWM1CON_POL_POSN                         equ 0004h
PWM1CON_POL_POSITION                     equ 0004h
PWM1CON_POL_SIZE                         equ 0001h
PWM1CON_POL_LENGTH                       equ 0001h
PWM1CON_POL_MASK                         equ 0010h
PWM1CON_OUT_POSN                         equ 0005h
PWM1CON_OUT_POSITION                     equ 0005h
PWM1CON_OUT_SIZE                         equ 0001h
PWM1CON_OUT_LENGTH                       equ 0001h
PWM1CON_OUT_MASK                         equ 0020h
PWM1CON_OE_POSN                          equ 0006h
PWM1CON_OE_POSITION                      equ 0006h
PWM1CON_OE_SIZE                          equ 0001h
PWM1CON_OE_LENGTH                        equ 0001h
PWM1CON_OE_MASK                          equ 0040h
PWM1CON_EN_POSN                          equ 0007h
PWM1CON_EN_POSITION                      equ 0007h
PWM1CON_EN_SIZE                          equ 0001h
PWM1CON_EN_LENGTH                        equ 0001h
PWM1CON_EN_MASK                          equ 0080h
PWM1CON_PWM1MODE0_POSN                   equ 0002h
PWM1CON_PWM1MODE0_POSITION               equ 0002h
PWM1CON_PWM1MODE0_SIZE                   equ 0001h
PWM1CON_PWM1MODE0_LENGTH                 equ 0001h
PWM1CON_PWM1MODE0_MASK                   equ 0004h
PWM1CON_PWM1MODE1_POSN                   equ 0003h
PWM1CON_PWM1MODE1_POSITION               equ 0003h
PWM1CON_PWM1MODE1_SIZE                   equ 0001h
PWM1CON_PWM1MODE1_LENGTH                 equ 0001h
PWM1CON_PWM1MODE1_MASK                   equ 0008h
PWM1CON_PWM1MODE_POSN                    equ 0002h
PWM1CON_PWM1MODE_POSITION                equ 0002h
PWM1CON_PWM1MODE_SIZE                    equ 0002h
PWM1CON_PWM1MODE_LENGTH                  equ 0002h
PWM1CON_PWM1MODE_MASK                    equ 000Ch
PWM1CON_PWM1POL_POSN                     equ 0004h
PWM1CON_PWM1POL_POSITION                 equ 0004h
PWM1CON_PWM1POL_SIZE                     equ 0001h
PWM1CON_PWM1POL_LENGTH                   equ 0001h
PWM1CON_PWM1POL_MASK                     equ 0010h
PWM1CON_PWM1OUT_POSN                     equ 0005h
PWM1CON_PWM1OUT_POSITION                 equ 0005h
PWM1CON_PWM1OUT_SIZE                     equ 0001h
PWM1CON_PWM1OUT_LENGTH                   equ 0001h
PWM1CON_PWM1OUT_MASK                     equ 0020h
PWM1CON_PWM1OE_POSN                      equ 0006h
PWM1CON_PWM1OE_POSITION                  equ 0006h
PWM1CON_PWM1OE_SIZE                      equ 0001h
PWM1CON_PWM1OE_LENGTH                    equ 0001h
PWM1CON_PWM1OE_MASK                      equ 0040h
PWM1CON_PWM1EN_POSN                      equ 0007h
PWM1CON_PWM1EN_POSITION                  equ 0007h
PWM1CON_PWM1EN_SIZE                      equ 0001h
PWM1CON_PWM1EN_LENGTH                    equ 0001h
PWM1CON_PWM1EN_MASK                      equ 0080h
PWM1CON_MODE0_POSN                       equ 0002h
PWM1CON_MODE0_POSITION                   equ 0002h
PWM1CON_MODE0_SIZE                       equ 0001h
PWM1CON_MODE0_LENGTH                     equ 0001h
PWM1CON_MODE0_MASK                       equ 0004h
PWM1CON_MODE1_POSN                       equ 0003h
PWM1CON_MODE1_POSITION                   equ 0003h
PWM1CON_MODE1_SIZE                       equ 0001h
PWM1CON_MODE1_LENGTH                     equ 0001h
PWM1CON_MODE1_MASK                       equ 0008h

// Register: PWM1INTE
#define PWM1INTE PWM1INTE
PWM1INTE                                 equ 0D9Ch
// bitfield definitions
PWM1INTE_PRIE_POSN                       equ 0000h
PWM1INTE_PRIE_POSITION                   equ 0000h
PWM1INTE_PRIE_SIZE                       equ 0001h
PWM1INTE_PRIE_LENGTH                     equ 0001h
PWM1INTE_PRIE_MASK                       equ 0001h
PWM1INTE_DCIE_POSN                       equ 0001h
PWM1INTE_DCIE_POSITION                   equ 0001h
PWM1INTE_DCIE_SIZE                       equ 0001h
PWM1INTE_DCIE_LENGTH                     equ 0001h
PWM1INTE_DCIE_MASK                       equ 0002h
PWM1INTE_PHIE_POSN                       equ 0002h
PWM1INTE_PHIE_POSITION                   equ 0002h
PWM1INTE_PHIE_SIZE                       equ 0001h
PWM1INTE_PHIE_LENGTH                     equ 0001h
PWM1INTE_PHIE_MASK                       equ 0004h
PWM1INTE_OFIE_POSN                       equ 0003h
PWM1INTE_OFIE_POSITION                   equ 0003h
PWM1INTE_OFIE_SIZE                       equ 0001h
PWM1INTE_OFIE_LENGTH                     equ 0001h
PWM1INTE_OFIE_MASK                       equ 0008h
PWM1INTE_PWM1PRIE_POSN                   equ 0000h
PWM1INTE_PWM1PRIE_POSITION               equ 0000h
PWM1INTE_PWM1PRIE_SIZE                   equ 0001h
PWM1INTE_PWM1PRIE_LENGTH                 equ 0001h
PWM1INTE_PWM1PRIE_MASK                   equ 0001h
PWM1INTE_PWM1DCIE_POSN                   equ 0001h
PWM1INTE_PWM1DCIE_POSITION               equ 0001h
PWM1INTE_PWM1DCIE_SIZE                   equ 0001h
PWM1INTE_PWM1DCIE_LENGTH                 equ 0001h
PWM1INTE_PWM1DCIE_MASK                   equ 0002h
PWM1INTE_PWM1PHIE_POSN                   equ 0002h
PWM1INTE_PWM1PHIE_POSITION               equ 0002h
PWM1INTE_PWM1PHIE_SIZE                   equ 0001h
PWM1INTE_PWM1PHIE_LENGTH                 equ 0001h
PWM1INTE_PWM1PHIE_MASK                   equ 0004h
PWM1INTE_PWM1OFIE_POSN                   equ 0003h
PWM1INTE_PWM1OFIE_POSITION               equ 0003h
PWM1INTE_PWM1OFIE_SIZE                   equ 0001h
PWM1INTE_PWM1OFIE_LENGTH                 equ 0001h
PWM1INTE_PWM1OFIE_MASK                   equ 0008h

// Register: PWM1INTF
#define PWM1INTF PWM1INTF
PWM1INTF                                 equ 0D9Dh
// bitfield definitions
PWM1INTF_PRIF_POSN                       equ 0000h
PWM1INTF_PRIF_POSITION                   equ 0000h
PWM1INTF_PRIF_SIZE                       equ 0001h
PWM1INTF_PRIF_LENGTH                     equ 0001h
PWM1INTF_PRIF_MASK                       equ 0001h
PWM1INTF_DCIF_POSN                       equ 0001h
PWM1INTF_DCIF_POSITION                   equ 0001h
PWM1INTF_DCIF_SIZE                       equ 0001h
PWM1INTF_DCIF_LENGTH                     equ 0001h
PWM1INTF_DCIF_MASK                       equ 0002h
PWM1INTF_PHIF_POSN                       equ 0002h
PWM1INTF_PHIF_POSITION                   equ 0002h
PWM1INTF_PHIF_SIZE                       equ 0001h
PWM1INTF_PHIF_LENGTH                     equ 0001h
PWM1INTF_PHIF_MASK                       equ 0004h
PWM1INTF_OFIF_POSN                       equ 0003h
PWM1INTF_OFIF_POSITION                   equ 0003h
PWM1INTF_OFIF_SIZE                       equ 0001h
PWM1INTF_OFIF_LENGTH                     equ 0001h
PWM1INTF_OFIF_MASK                       equ 0008h
PWM1INTF_PWM1PRIF_POSN                   equ 0000h
PWM1INTF_PWM1PRIF_POSITION               equ 0000h
PWM1INTF_PWM1PRIF_SIZE                   equ 0001h
PWM1INTF_PWM1PRIF_LENGTH                 equ 0001h
PWM1INTF_PWM1PRIF_MASK                   equ 0001h
PWM1INTF_PWM1DCIF_POSN                   equ 0001h
PWM1INTF_PWM1DCIF_POSITION               equ 0001h
PWM1INTF_PWM1DCIF_SIZE                   equ 0001h
PWM1INTF_PWM1DCIF_LENGTH                 equ 0001h
PWM1INTF_PWM1DCIF_MASK                   equ 0002h
PWM1INTF_PWM1PHIF_POSN                   equ 0002h
PWM1INTF_PWM1PHIF_POSITION               equ 0002h
PWM1INTF_PWM1PHIF_SIZE                   equ 0001h
PWM1INTF_PWM1PHIF_LENGTH                 equ 0001h
PWM1INTF_PWM1PHIF_MASK                   equ 0004h
PWM1INTF_PWM1OFIF_POSN                   equ 0003h
PWM1INTF_PWM1OFIF_POSITION               equ 0003h
PWM1INTF_PWM1OFIF_SIZE                   equ 0001h
PWM1INTF_PWM1OFIF_LENGTH                 equ 0001h
PWM1INTF_PWM1OFIF_MASK                   equ 0008h

// Register: PWM1CLKCON
#define PWM1CLKCON PWM1CLKCON
PWM1CLKCON                               equ 0D9Eh
// bitfield definitions
PWM1CLKCON_CS_POSN                       equ 0000h
PWM1CLKCON_CS_POSITION                   equ 0000h
PWM1CLKCON_CS_SIZE                       equ 0002h
PWM1CLKCON_CS_LENGTH                     equ 0002h
PWM1CLKCON_CS_MASK                       equ 0003h
PWM1CLKCON_PS_POSN                       equ 0004h
PWM1CLKCON_PS_POSITION                   equ 0004h
PWM1CLKCON_PS_SIZE                       equ 0003h
PWM1CLKCON_PS_LENGTH                     equ 0003h
PWM1CLKCON_PS_MASK                       equ 0070h
PWM1CLKCON_PWM1CS0_POSN                  equ 0000h
PWM1CLKCON_PWM1CS0_POSITION              equ 0000h
PWM1CLKCON_PWM1CS0_SIZE                  equ 0001h
PWM1CLKCON_PWM1CS0_LENGTH                equ 0001h
PWM1CLKCON_PWM1CS0_MASK                  equ 0001h
PWM1CLKCON_PWM1CS1_POSN                  equ 0001h
PWM1CLKCON_PWM1CS1_POSITION              equ 0001h
PWM1CLKCON_PWM1CS1_SIZE                  equ 0001h
PWM1CLKCON_PWM1CS1_LENGTH                equ 0001h
PWM1CLKCON_PWM1CS1_MASK                  equ 0002h
PWM1CLKCON_PWM1PS0_POSN                  equ 0004h
PWM1CLKCON_PWM1PS0_POSITION              equ 0004h
PWM1CLKCON_PWM1PS0_SIZE                  equ 0001h
PWM1CLKCON_PWM1PS0_LENGTH                equ 0001h
PWM1CLKCON_PWM1PS0_MASK                  equ 0010h
PWM1CLKCON_PWM1PS1_POSN                  equ 0005h
PWM1CLKCON_PWM1PS1_POSITION              equ 0005h
PWM1CLKCON_PWM1PS1_SIZE                  equ 0001h
PWM1CLKCON_PWM1PS1_LENGTH                equ 0001h
PWM1CLKCON_PWM1PS1_MASK                  equ 0020h
PWM1CLKCON_PWM1PS2_POSN                  equ 0006h
PWM1CLKCON_PWM1PS2_POSITION              equ 0006h
PWM1CLKCON_PWM1PS2_SIZE                  equ 0001h
PWM1CLKCON_PWM1PS2_LENGTH                equ 0001h
PWM1CLKCON_PWM1PS2_MASK                  equ 0040h
PWM1CLKCON_PWM1CS_POSN                   equ 0000h
PWM1CLKCON_PWM1CS_POSITION               equ 0000h
PWM1CLKCON_PWM1CS_SIZE                   equ 0003h
PWM1CLKCON_PWM1CS_LENGTH                 equ 0003h
PWM1CLKCON_PWM1CS_MASK                   equ 0007h
PWM1CLKCON_PWM1PS_POSN                   equ 0004h
PWM1CLKCON_PWM1PS_POSITION               equ 0004h
PWM1CLKCON_PWM1PS_SIZE                   equ 0003h
PWM1CLKCON_PWM1PS_LENGTH                 equ 0003h
PWM1CLKCON_PWM1PS_MASK                   equ 0070h
PWM1CLKCON_CS0_POSN                      equ 0000h
PWM1CLKCON_CS0_POSITION                  equ 0000h
PWM1CLKCON_CS0_SIZE                      equ 0001h
PWM1CLKCON_CS0_LENGTH                    equ 0001h
PWM1CLKCON_CS0_MASK                      equ 0001h
PWM1CLKCON_CS1_POSN                      equ 0001h
PWM1CLKCON_CS1_POSITION                  equ 0001h
PWM1CLKCON_CS1_SIZE                      equ 0001h
PWM1CLKCON_CS1_LENGTH                    equ 0001h
PWM1CLKCON_CS1_MASK                      equ 0002h
PWM1CLKCON_PS0_POSN                      equ 0004h
PWM1CLKCON_PS0_POSITION                  equ 0004h
PWM1CLKCON_PS0_SIZE                      equ 0001h
PWM1CLKCON_PS0_LENGTH                    equ 0001h
PWM1CLKCON_PS0_MASK                      equ 0010h
PWM1CLKCON_PS1_POSN                      equ 0005h
PWM1CLKCON_PS1_POSITION                  equ 0005h
PWM1CLKCON_PS1_SIZE                      equ 0001h
PWM1CLKCON_PS1_LENGTH                    equ 0001h
PWM1CLKCON_PS1_MASK                      equ 0020h
PWM1CLKCON_PS2_POSN                      equ 0006h
PWM1CLKCON_PS2_POSITION                  equ 0006h
PWM1CLKCON_PS2_SIZE                      equ 0001h
PWM1CLKCON_PS2_LENGTH                    equ 0001h
PWM1CLKCON_PS2_MASK                      equ 0040h

// Register: PWM1LDCON
#define PWM1LDCON PWM1LDCON
PWM1LDCON                                equ 0D9Fh
// bitfield definitions
PWM1LDCON_LDS_POSN                       equ 0000h
PWM1LDCON_LDS_POSITION                   equ 0000h
PWM1LDCON_LDS_SIZE                       equ 0002h
PWM1LDCON_LDS_LENGTH                     equ 0002h
PWM1LDCON_LDS_MASK                       equ 0003h
PWM1LDCON_LDT_POSN                       equ 0006h
PWM1LDCON_LDT_POSITION                   equ 0006h
PWM1LDCON_LDT_SIZE                       equ 0001h
PWM1LDCON_LDT_LENGTH                     equ 0001h
PWM1LDCON_LDT_MASK                       equ 0040h
PWM1LDCON_LDA_POSN                       equ 0007h
PWM1LDCON_LDA_POSITION                   equ 0007h
PWM1LDCON_LDA_SIZE                       equ 0001h
PWM1LDCON_LDA_LENGTH                     equ 0001h
PWM1LDCON_LDA_MASK                       equ 0080h
PWM1LDCON_PWM1LDS0_POSN                  equ 0000h
PWM1LDCON_PWM1LDS0_POSITION              equ 0000h
PWM1LDCON_PWM1LDS0_SIZE                  equ 0001h
PWM1LDCON_PWM1LDS0_LENGTH                equ 0001h
PWM1LDCON_PWM1LDS0_MASK                  equ 0001h
PWM1LDCON_PWM1LDS1_POSN                  equ 0001h
PWM1LDCON_PWM1LDS1_POSITION              equ 0001h
PWM1LDCON_PWM1LDS1_SIZE                  equ 0001h
PWM1LDCON_PWM1LDS1_LENGTH                equ 0001h
PWM1LDCON_PWM1LDS1_MASK                  equ 0002h
PWM1LDCON_PWM1LDS_POSN                   equ 0000h
PWM1LDCON_PWM1LDS_POSITION               equ 0000h
PWM1LDCON_PWM1LDS_SIZE                   equ 0002h
PWM1LDCON_PWM1LDS_LENGTH                 equ 0002h
PWM1LDCON_PWM1LDS_MASK                   equ 0003h
PWM1LDCON_PWM1LDM_POSN                   equ 0006h
PWM1LDCON_PWM1LDM_POSITION               equ 0006h
PWM1LDCON_PWM1LDM_SIZE                   equ 0001h
PWM1LDCON_PWM1LDM_LENGTH                 equ 0001h
PWM1LDCON_PWM1LDM_MASK                   equ 0040h
PWM1LDCON_PWM1LD_POSN                    equ 0007h
PWM1LDCON_PWM1LD_POSITION                equ 0007h
PWM1LDCON_PWM1LD_SIZE                    equ 0001h
PWM1LDCON_PWM1LD_LENGTH                  equ 0001h
PWM1LDCON_PWM1LD_MASK                    equ 0080h
PWM1LDCON_LDS0_POSN                      equ 0000h
PWM1LDCON_LDS0_POSITION                  equ 0000h
PWM1LDCON_LDS0_SIZE                      equ 0001h
PWM1LDCON_LDS0_LENGTH                    equ 0001h
PWM1LDCON_LDS0_MASK                      equ 0001h
PWM1LDCON_LDS1_POSN                      equ 0001h
PWM1LDCON_LDS1_POSITION                  equ 0001h
PWM1LDCON_LDS1_SIZE                      equ 0001h
PWM1LDCON_LDS1_LENGTH                    equ 0001h
PWM1LDCON_LDS1_MASK                      equ 0002h

