GopalSaraf/Practicals/PSDL/include/proc/pic16lf1578.inc
// Register: PWM4DCH
#define PWM4DCH PWM4DCH
PWM4DCH                                  equ 0DC4h
// bitfield definitions
PWM4DCH_DC_POSN                          equ 0000h
PWM4DCH_DC_POSITION                      equ 0000h
PWM4DCH_DC_SIZE                          equ 0008h
PWM4DCH_DC_LENGTH                        equ 0008h
PWM4DCH_DC_MASK                          equ 00FFh
PWM4DCH_PWM4DCH0_POSN                    equ 0000h
PWM4DCH_PWM4DCH0_POSITION                equ 0000h
PWM4DCH_PWM4DCH0_SIZE                    equ 0001h
PWM4DCH_PWM4DCH0_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH0_MASK                    equ 0001h
PWM4DCH_PWM4DCH1_POSN                    equ 0001h
PWM4DCH_PWM4DCH1_POSITION                equ 0001h
PWM4DCH_PWM4DCH1_SIZE                    equ 0001h
PWM4DCH_PWM4DCH1_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH1_MASK                    equ 0002h
PWM4DCH_PWM4DCH2_POSN                    equ 0002h
PWM4DCH_PWM4DCH2_POSITION                equ 0002h
PWM4DCH_PWM4DCH2_SIZE                    equ 0001h
PWM4DCH_PWM4DCH2_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH2_MASK                    equ 0004h
PWM4DCH_PWM4DCH3_POSN                    equ 0003h
PWM4DCH_PWM4DCH3_POSITION                equ 0003h
PWM4DCH_PWM4DCH3_SIZE                    equ 0001h
PWM4DCH_PWM4DCH3_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH3_MASK                    equ 0008h
PWM4DCH_PWM4DCH4_POSN                    equ 0004h
PWM4DCH_PWM4DCH4_POSITION                equ 0004h
PWM4DCH_PWM4DCH4_SIZE                    equ 0001h
PWM4DCH_PWM4DCH4_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH4_MASK                    equ 0010h
PWM4DCH_PWM4DCH5_POSN                    equ 0005h
PWM4DCH_PWM4DCH5_POSITION                equ 0005h
PWM4DCH_PWM4DCH5_SIZE                    equ 0001h
PWM4DCH_PWM4DCH5_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH5_MASK                    equ 0020h
PWM4DCH_PWM4DCH6_POSN                    equ 0006h
PWM4DCH_PWM4DCH6_POSITION                equ 0006h
PWM4DCH_PWM4DCH6_SIZE                    equ 0001h
PWM4DCH_PWM4DCH6_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH6_MASK                    equ 0040h
PWM4DCH_PWM4DCH7_POSN                    equ 0007h
PWM4DCH_PWM4DCH7_POSITION                equ 0007h
PWM4DCH_PWM4DCH7_SIZE                    equ 0001h
PWM4DCH_PWM4DCH7_LENGTH                  equ 0001h
PWM4DCH_PWM4DCH7_MASK                    equ 0080h
PWM4DCH_PWM4DCH_POSN                     equ 0000h
PWM4DCH_PWM4DCH_POSITION                 equ 0000h
PWM4DCH_PWM4DCH_SIZE                     equ 0008h
PWM4DCH_PWM4DCH_LENGTH                   equ 0008h
PWM4DCH_PWM4DCH_MASK                     equ 00FFh

// Register: PWM4PRL
#define PWM4PRL PWM4PRL
PWM4PRL                                  equ 0DC5h
// bitfield definitions
PWM4PRL_PR_POSN                          equ 0000h
PWM4PRL_PR_POSITION                      equ 0000h
PWM4PRL_PR_SIZE                          equ 0008h
PWM4PRL_PR_LENGTH                        equ 0008h
PWM4PRL_PR_MASK                          equ 00FFh
PWM4PRL_PWM4PRL0_POSN                    equ 0000h
PWM4PRL_PWM4PRL0_POSITION                equ 0000h
PWM4PRL_PWM4PRL0_SIZE                    equ 0001h
PWM4PRL_PWM4PRL0_LENGTH                  equ 0001h
PWM4PRL_PWM4PRL0_MASK                    equ 0001h
PWM4PRL_PWM4PRL1_POSN                    equ 0001h
PWM4PRL_PWM4PRL1_POSITION                equ 0001h
PWM4PRL_PWM4PRL1_SIZE                    equ 0001h
PWM4PRL_PWM4PRL1_LENGTH                  equ 0001h
PWM4PRL_PWM4PRL1_MASK                    equ 0002h
PWM4PRL_PWM4PRL2_POSN                    equ 0002h
PWM4PRL_PWM4PRL2_POSITION                equ 0002h
PWM4PRL_PWM4PRL2_SIZE                    equ 0001h
PWM4PRL_PWM4PRL2_LENGTH                  equ 0001h
PWM4PRL_PWM4PRL2_MASK                    equ 0004h
PWM4PRL_PWM4PRL3_POSN                    equ 0003h
PWM4PRL_PWM4PRL3_POSITION                equ 0003h
PWM4PRL_PWM4PRL3_SIZE                    equ 0001h
PWM4PRL_PWM4PRL3_LENGTH                  equ 0001h
PWM4PRL_PWM4PRL3_MASK                    equ 0008h
PWM4PRL_PWM4PRL4_POSN                    equ 0004h
PWM4PRL_PWM4PRL4_POSITION                equ 0004h
PWM4PRL_PWM4PRL4_SIZE                    equ 0001h
PWM4PRL_PWM4PRL4_LENGTH                  equ 0001h
PWM4PRL_PWM4PRL4_MASK                    equ 0010h
PWM4PRL_PWM4PRL5_POSN                    equ 0005h
PWM4PRL_PWM4PRL5_POSITION                equ 0005h
PWM4PRL_PWM4PRL5_SIZE                    equ 0001h
PWM4PRL_PWM4PRL5_LENGTH                  equ 0001h
PWM4PRL_PWM4PRL5_MASK                    equ 0020h
PWM4PRL_PWM4PRL6_POSN                    equ 0006h
PWM4PRL_PWM4PRL6_POSITION                equ 0006h
PWM4PRL_PWM4PRL6_SIZE                    equ 0001h
PWM4PRL_PWM4PRL6_LENGTH                  equ 0001h
PWM4PRL_PWM4PRL6_MASK                    equ 0040h
PWM4PRL_PWM4PRL7_POSN                    equ 0007h
PWM4PRL_PWM4PRL7_POSITION                equ 0007h
PWM4PRL_PWM4PRL7_SIZE                    equ 0001h
PWM4PRL_PWM4PRL7_LENGTH                  equ 0001h
PWM4PRL_PWM4PRL7_MASK                    equ 0080h
PWM4PRL_PWM4PRL_POSN                     equ 0000h
PWM4PRL_PWM4PRL_POSITION                 equ 0000h
PWM4PRL_PWM4PRL_SIZE                     equ 0008h
PWM4PRL_PWM4PRL_LENGTH                   equ 0008h
PWM4PRL_PWM4PRL_MASK                     equ 00FFh

// Register: PWM4PRH
#define PWM4PRH PWM4PRH
PWM4PRH                                  equ 0DC6h
// bitfield definitions
PWM4PRH_PR_POSN                          equ 0000h
PWM4PRH_PR_POSITION                      equ 0000h
PWM4PRH_PR_SIZE                          equ 0008h
PWM4PRH_PR_LENGTH                        equ 0008h
PWM4PRH_PR_MASK                          equ 00FFh
PWM4PRH_PWM4PRH0_POSN                    equ 0000h
PWM4PRH_PWM4PRH0_POSITION                equ 0000h
PWM4PRH_PWM4PRH0_SIZE                    equ 0001h
PWM4PRH_PWM4PRH0_LENGTH                  equ 0001h
PWM4PRH_PWM4PRH0_MASK                    equ 0001h
PWM4PRH_PWM4PRH1_POSN                    equ 0001h
PWM4PRH_PWM4PRH1_POSITION                equ 0001h
PWM4PRH_PWM4PRH1_SIZE                    equ 0001h
PWM4PRH_PWM4PRH1_LENGTH                  equ 0001h
PWM4PRH_PWM4PRH1_MASK                    equ 0002h
PWM4PRH_PWM4PRH2_POSN                    equ 0002h
PWM4PRH_PWM4PRH2_POSITION                equ 0002h
PWM4PRH_PWM4PRH2_SIZE                    equ 0001h
PWM4PRH_PWM4PRH2_LENGTH                  equ 0001h
PWM4PRH_PWM4PRH2_MASK                    equ 0004h
PWM4PRH_PWM4PRH3_POSN                    equ 0003h
PWM4PRH_PWM4PRH3_POSITION                equ 0003h
PWM4PRH_PWM4PRH3_SIZE                    equ 0001h
PWM4PRH_PWM4PRH3_LENGTH                  equ 0001h
PWM4PRH_PWM4PRH3_MASK                    equ 0008h
PWM4PRH_PWM4PRH4_POSN                    equ 0004h
PWM4PRH_PWM4PRH4_POSITION                equ 0004h
PWM4PRH_PWM4PRH4_SIZE                    equ 0001h
PWM4PRH_PWM4PRH4_LENGTH                  equ 0001h
PWM4PRH_PWM4PRH4_MASK                    equ 0010h
PWM4PRH_PWM4PRH5_POSN                    equ 0005h
PWM4PRH_PWM4PRH5_POSITION                equ 0005h
PWM4PRH_PWM4PRH5_SIZE                    equ 0001h
PWM4PRH_PWM4PRH5_LENGTH                  equ 0001h
PWM4PRH_PWM4PRH5_MASK                    equ 0020h
PWM4PRH_PWM4PRH6_POSN                    equ 0006h
PWM4PRH_PWM4PRH6_POSITION                equ 0006h
PWM4PRH_PWM4PRH6_SIZE                    equ 0001h
PWM4PRH_PWM4PRH6_LENGTH                  equ 0001h
PWM4PRH_PWM4PRH6_MASK                    equ 0040h
PWM4PRH_PWM4PRH7_POSN                    equ 0007h
PWM4PRH_PWM4PRH7_POSITION                equ 0007h
PWM4PRH_PWM4PRH7_SIZE                    equ 0001h
PWM4PRH_PWM4PRH7_LENGTH                  equ 0001h
PWM4PRH_PWM4PRH7_MASK                    equ 0080h
PWM4PRH_PWM4PRH_POSN                     equ 0000h
PWM4PRH_PWM4PRH_POSITION                 equ 0000h
PWM4PRH_PWM4PRH_SIZE                     equ 0008h
PWM4PRH_PWM4PRH_LENGTH                   equ 0008h
PWM4PRH_PWM4PRH_MASK                     equ 00FFh

// Register: PWM4OFL
#define PWM4OFL PWM4OFL
PWM4OFL                                  equ 0DC7h
// bitfield definitions
PWM4OFL_OF_POSN                          equ 0000h
PWM4OFL_OF_POSITION                      equ 0000h
PWM4OFL_OF_SIZE                          equ 0008h
PWM4OFL_OF_LENGTH                        equ 0008h
PWM4OFL_OF_MASK                          equ 00FFh
PWM4OFL_PWM4OFL0_POSN                    equ 0000h
PWM4OFL_PWM4OFL0_POSITION                equ 0000h
PWM4OFL_PWM4OFL0_SIZE                    equ 0001h
PWM4OFL_PWM4OFL0_LENGTH                  equ 0001h
PWM4OFL_PWM4OFL0_MASK                    equ 0001h
PWM4OFL_PWM4OFL1_POSN                    equ 0001h
PWM4OFL_PWM4OFL1_POSITION                equ 0001h
PWM4OFL_PWM4OFL1_SIZE                    equ 0001h
PWM4OFL_PWM4OFL1_LENGTH                  equ 0001h
PWM4OFL_PWM4OFL1_MASK                    equ 0002h
PWM4OFL_PWM4OFL2_POSN                    equ 0002h
PWM4OFL_PWM4OFL2_POSITION                equ 0002h
PWM4OFL_PWM4OFL2_SIZE                    equ 0001h
PWM4OFL_PWM4OFL2_LENGTH                  equ 0001h
PWM4OFL_PWM4OFL2_MASK                    equ 0004h
PWM4OFL_PWM4OFL3_POSN                    equ 0003h
PWM4OFL_PWM4OFL3_POSITION                equ 0003h
PWM4OFL_PWM4OFL3_SIZE                    equ 0001h
PWM4OFL_PWM4OFL3_LENGTH                  equ 0001h
PWM4OFL_PWM4OFL3_MASK                    equ 0008h
PWM4OFL_PWM4OFL4_POSN                    equ 0004h
PWM4OFL_PWM4OFL4_POSITION                equ 0004h
PWM4OFL_PWM4OFL4_SIZE                    equ 0001h
PWM4OFL_PWM4OFL4_LENGTH                  equ 0001h
PWM4OFL_PWM4OFL4_MASK                    equ 0010h
PWM4OFL_PWM4OFL5_POSN                    equ 0005h
PWM4OFL_PWM4OFL5_POSITION                equ 0005h
PWM4OFL_PWM4OFL5_SIZE                    equ 0001h
PWM4OFL_PWM4OFL5_LENGTH                  equ 0001h
PWM4OFL_PWM4OFL5_MASK                    equ 0020h
PWM4OFL_PWM4OFL6_POSN                    equ 0006h
PWM4OFL_PWM4OFL6_POSITION                equ 0006h
PWM4OFL_PWM4OFL6_SIZE                    equ 0001h
PWM4OFL_PWM4OFL6_LENGTH                  equ 0001h
PWM4OFL_PWM4OFL6_MASK                    equ 0040h
PWM4OFL_PWM4OFL7_POSN                    equ 0007h
PWM4OFL_PWM4OFL7_POSITION                equ 0007h
PWM4OFL_PWM4OFL7_SIZE                    equ 0001h
PWM4OFL_PWM4OFL7_LENGTH                  equ 0001h
PWM4OFL_PWM4OFL7_MASK                    equ 0080h
PWM4OFL_PWM4OFL_POSN                     equ 0000h
PWM4OFL_PWM4OFL_POSITION                 equ 0000h
PWM4OFL_PWM4OFL_SIZE                     equ 0008h
PWM4OFL_PWM4OFL_LENGTH                   equ 0008h
PWM4OFL_PWM4OFL_MASK                     equ 00FFh

