GopalSaraf/Practicals/PSDL/include/proc/pic16lf1578.inc
// Register: PWM4CLKCON
#define PWM4CLKCON PWM4CLKCON
PWM4CLKCON                               equ 0DCEh
// bitfield definitions
PWM4CLKCON_CS_POSN                       equ 0000h
PWM4CLKCON_CS_POSITION                   equ 0000h
PWM4CLKCON_CS_SIZE                       equ 0002h
PWM4CLKCON_CS_LENGTH                     equ 0002h
PWM4CLKCON_CS_MASK                       equ 0003h
PWM4CLKCON_PS_POSN                       equ 0004h
PWM4CLKCON_PS_POSITION                   equ 0004h
PWM4CLKCON_PS_SIZE                       equ 0003h
PWM4CLKCON_PS_LENGTH                     equ 0003h
PWM4CLKCON_PS_MASK                       equ 0070h
PWM4CLKCON_PWM4CS0_POSN                  equ 0000h
PWM4CLKCON_PWM4CS0_POSITION              equ 0000h
PWM4CLKCON_PWM4CS0_SIZE                  equ 0001h
PWM4CLKCON_PWM4CS0_LENGTH                equ 0001h
PWM4CLKCON_PWM4CS0_MASK                  equ 0001h
PWM4CLKCON_PWM4CS1_POSN                  equ 0001h
PWM4CLKCON_PWM4CS1_POSITION              equ 0001h
PWM4CLKCON_PWM4CS1_SIZE                  equ 0001h
PWM4CLKCON_PWM4CS1_LENGTH                equ 0001h
PWM4CLKCON_PWM4CS1_MASK                  equ 0002h
PWM4CLKCON_PWM4PS0_POSN                  equ 0004h
PWM4CLKCON_PWM4PS0_POSITION              equ 0004h
PWM4CLKCON_PWM4PS0_SIZE                  equ 0001h
PWM4CLKCON_PWM4PS0_LENGTH                equ 0001h
PWM4CLKCON_PWM4PS0_MASK                  equ 0010h
PWM4CLKCON_PWM4PS1_POSN                  equ 0005h
PWM4CLKCON_PWM4PS1_POSITION              equ 0005h
PWM4CLKCON_PWM4PS1_SIZE                  equ 0001h
PWM4CLKCON_PWM4PS1_LENGTH                equ 0001h
PWM4CLKCON_PWM4PS1_MASK                  equ 0020h
PWM4CLKCON_PWM4PS2_POSN                  equ 0006h
PWM4CLKCON_PWM4PS2_POSITION              equ 0006h
PWM4CLKCON_PWM4PS2_SIZE                  equ 0001h
PWM4CLKCON_PWM4PS2_LENGTH                equ 0001h
PWM4CLKCON_PWM4PS2_MASK                  equ 0040h
PWM4CLKCON_PWM4CS_POSN                   equ 0000h
PWM4CLKCON_PWM4CS_POSITION               equ 0000h
PWM4CLKCON_PWM4CS_SIZE                   equ 0003h
PWM4CLKCON_PWM4CS_LENGTH                 equ 0003h
PWM4CLKCON_PWM4CS_MASK                   equ 0007h
PWM4CLKCON_PWM4PS_POSN                   equ 0004h
PWM4CLKCON_PWM4PS_POSITION               equ 0004h
PWM4CLKCON_PWM4PS_SIZE                   equ 0003h
PWM4CLKCON_PWM4PS_LENGTH                 equ 0003h
PWM4CLKCON_PWM4PS_MASK                   equ 0070h
PWM4CLKCON_CS0_POSN                      equ 0000h
PWM4CLKCON_CS0_POSITION                  equ 0000h
PWM4CLKCON_CS0_SIZE                      equ 0001h
PWM4CLKCON_CS0_LENGTH                    equ 0001h
PWM4CLKCON_CS0_MASK                      equ 0001h
PWM4CLKCON_CS1_POSN                      equ 0001h
PWM4CLKCON_CS1_POSITION                  equ 0001h
PWM4CLKCON_CS1_SIZE                      equ 0001h
PWM4CLKCON_CS1_LENGTH                    equ 0001h
PWM4CLKCON_CS1_MASK                      equ 0002h
PWM4CLKCON_PS0_POSN                      equ 0004h
PWM4CLKCON_PS0_POSITION                  equ 0004h
PWM4CLKCON_PS0_SIZE                      equ 0001h
PWM4CLKCON_PS0_LENGTH                    equ 0001h
PWM4CLKCON_PS0_MASK                      equ 0010h
PWM4CLKCON_PS1_POSN                      equ 0005h
PWM4CLKCON_PS1_POSITION                  equ 0005h
PWM4CLKCON_PS1_SIZE                      equ 0001h
PWM4CLKCON_PS1_LENGTH                    equ 0001h
PWM4CLKCON_PS1_MASK                      equ 0020h
PWM4CLKCON_PS2_POSN                      equ 0006h
PWM4CLKCON_PS2_POSITION                  equ 0006h
PWM4CLKCON_PS2_SIZE                      equ 0001h
PWM4CLKCON_PS2_LENGTH                    equ 0001h
PWM4CLKCON_PS2_MASK                      equ 0040h

// Register: PWM4LDCON
#define PWM4LDCON PWM4LDCON
PWM4LDCON                                equ 0DCFh
// bitfield definitions
PWM4LDCON_LDS_POSN                       equ 0000h
PWM4LDCON_LDS_POSITION                   equ 0000h
PWM4LDCON_LDS_SIZE                       equ 0002h
PWM4LDCON_LDS_LENGTH                     equ 0002h
PWM4LDCON_LDS_MASK                       equ 0003h
PWM4LDCON_LDT_POSN                       equ 0006h
PWM4LDCON_LDT_POSITION                   equ 0006h
PWM4LDCON_LDT_SIZE                       equ 0001h
PWM4LDCON_LDT_LENGTH                     equ 0001h
PWM4LDCON_LDT_MASK                       equ 0040h
PWM4LDCON_LDA_POSN                       equ 0007h
PWM4LDCON_LDA_POSITION                   equ 0007h
PWM4LDCON_LDA_SIZE                       equ 0001h
PWM4LDCON_LDA_LENGTH                     equ 0001h
PWM4LDCON_LDA_MASK                       equ 0080h
PWM4LDCON_PWM4LDS0_POSN                  equ 0000h
PWM4LDCON_PWM4LDS0_POSITION              equ 0000h
PWM4LDCON_PWM4LDS0_SIZE                  equ 0001h
PWM4LDCON_PWM4LDS0_LENGTH                equ 0001h
PWM4LDCON_PWM4LDS0_MASK                  equ 0001h
PWM4LDCON_PWM4LDS1_POSN                  equ 0001h
PWM4LDCON_PWM4LDS1_POSITION              equ 0001h
PWM4LDCON_PWM4LDS1_SIZE                  equ 0001h
PWM4LDCON_PWM4LDS1_LENGTH                equ 0001h
PWM4LDCON_PWM4LDS1_MASK                  equ 0002h
PWM4LDCON_PWM4LDS_POSN                   equ 0000h
PWM4LDCON_PWM4LDS_POSITION               equ 0000h
PWM4LDCON_PWM4LDS_SIZE                   equ 0002h
PWM4LDCON_PWM4LDS_LENGTH                 equ 0002h
PWM4LDCON_PWM4LDS_MASK                   equ 0003h
PWM4LDCON_PWM4LDM_POSN                   equ 0006h
PWM4LDCON_PWM4LDM_POSITION               equ 0006h
PWM4LDCON_PWM4LDM_SIZE                   equ 0001h
PWM4LDCON_PWM4LDM_LENGTH                 equ 0001h
PWM4LDCON_PWM4LDM_MASK                   equ 0040h
PWM4LDCON_PWM4LD_POSN                    equ 0007h
PWM4LDCON_PWM4LD_POSITION                equ 0007h
PWM4LDCON_PWM4LD_SIZE                    equ 0001h
PWM4LDCON_PWM4LD_LENGTH                  equ 0001h
PWM4LDCON_PWM4LD_MASK                    equ 0080h
PWM4LDCON_LDS0_POSN                      equ 0000h
PWM4LDCON_LDS0_POSITION                  equ 0000h
PWM4LDCON_LDS0_SIZE                      equ 0001h
PWM4LDCON_LDS0_LENGTH                    equ 0001h
PWM4LDCON_LDS0_MASK                      equ 0001h
PWM4LDCON_LDS1_POSN                      equ 0001h
PWM4LDCON_LDS1_POSITION                  equ 0001h
PWM4LDCON_LDS1_SIZE                      equ 0001h
PWM4LDCON_LDS1_LENGTH                    equ 0001h
PWM4LDCON_LDS1_MASK                      equ 0002h

// Register: PWM4OFCON
#define PWM4OFCON PWM4OFCON
PWM4OFCON                                equ 0DD0h
// bitfield definitions
PWM4OFCON_OFS_POSN                       equ 0000h
PWM4OFCON_OFS_POSITION                   equ 0000h
PWM4OFCON_OFS_SIZE                       equ 0002h
PWM4OFCON_OFS_LENGTH                     equ 0002h
PWM4OFCON_OFS_MASK                       equ 0003h
PWM4OFCON_OFO_POSN                       equ 0004h
PWM4OFCON_OFO_POSITION                   equ 0004h
PWM4OFCON_OFO_SIZE                       equ 0001h
PWM4OFCON_OFO_LENGTH                     equ 0001h
PWM4OFCON_OFO_MASK                       equ 0010h
PWM4OFCON_OFM_POSN                       equ 0005h
PWM4OFCON_OFM_POSITION                   equ 0005h
PWM4OFCON_OFM_SIZE                       equ 0002h
PWM4OFCON_OFM_LENGTH                     equ 0002h
PWM4OFCON_OFM_MASK                       equ 0060h
PWM4OFCON_PWM4OFS0_POSN                  equ 0000h
PWM4OFCON_PWM4OFS0_POSITION              equ 0000h
PWM4OFCON_PWM4OFS0_SIZE                  equ 0001h
PWM4OFCON_PWM4OFS0_LENGTH                equ 0001h
PWM4OFCON_PWM4OFS0_MASK                  equ 0001h
PWM4OFCON_PWM4OFS1_POSN                  equ 0001h
PWM4OFCON_PWM4OFS1_POSITION              equ 0001h
PWM4OFCON_PWM4OFS1_SIZE                  equ 0001h
PWM4OFCON_PWM4OFS1_LENGTH                equ 0001h
PWM4OFCON_PWM4OFS1_MASK                  equ 0002h
PWM4OFCON_PWM4OFM0_POSN                  equ 0005h
PWM4OFCON_PWM4OFM0_POSITION              equ 0005h
PWM4OFCON_PWM4OFM0_SIZE                  equ 0001h
PWM4OFCON_PWM4OFM0_LENGTH                equ 0001h
PWM4OFCON_PWM4OFM0_MASK                  equ 0020h
PWM4OFCON_PWM4OFM1_POSN                  equ 0006h
PWM4OFCON_PWM4OFM1_POSITION              equ 0006h
PWM4OFCON_PWM4OFM1_SIZE                  equ 0001h
PWM4OFCON_PWM4OFM1_LENGTH                equ 0001h
PWM4OFCON_PWM4OFM1_MASK                  equ 0040h
PWM4OFCON_PWM4OFS_POSN                   equ 0000h
PWM4OFCON_PWM4OFS_POSITION               equ 0000h
PWM4OFCON_PWM4OFS_SIZE                   equ 0002h
PWM4OFCON_PWM4OFS_LENGTH                 equ 0002h
PWM4OFCON_PWM4OFS_MASK                   equ 0003h
PWM4OFCON_PWM4OFMC_POSN                  equ 0004h
PWM4OFCON_PWM4OFMC_POSITION              equ 0004h
PWM4OFCON_PWM4OFMC_SIZE                  equ 0001h
PWM4OFCON_PWM4OFMC_LENGTH                equ 0001h
PWM4OFCON_PWM4OFMC_MASK                  equ 0010h
PWM4OFCON_PWM4OFM_POSN                   equ 0005h
PWM4OFCON_PWM4OFM_POSITION               equ 0005h
PWM4OFCON_PWM4OFM_SIZE                   equ 0002h
PWM4OFCON_PWM4OFM_LENGTH                 equ 0002h
PWM4OFCON_PWM4OFM_MASK                   equ 0060h
PWM4OFCON_OFS0_POSN                      equ 0000h
PWM4OFCON_OFS0_POSITION                  equ 0000h
PWM4OFCON_OFS0_SIZE                      equ 0001h
PWM4OFCON_OFS0_LENGTH                    equ 0001h
PWM4OFCON_OFS0_MASK                      equ 0001h
PWM4OFCON_OFS1_POSN                      equ 0001h
PWM4OFCON_OFS1_POSITION                  equ 0001h
PWM4OFCON_OFS1_SIZE                      equ 0001h
PWM4OFCON_OFS1_LENGTH                    equ 0001h
PWM4OFCON_OFS1_MASK                      equ 0002h
PWM4OFCON_OFM0_POSN                      equ 0005h
PWM4OFCON_OFM0_POSITION                  equ 0005h
PWM4OFCON_OFM0_SIZE                      equ 0001h
PWM4OFCON_OFM0_LENGTH                    equ 0001h
PWM4OFCON_OFM0_MASK                      equ 0020h
PWM4OFCON_OFM1_POSN                      equ 0006h
PWM4OFCON_OFM1_POSITION                  equ 0006h
PWM4OFCON_OFM1_SIZE                      equ 0001h
PWM4OFCON_OFM1_LENGTH                    equ 0001h
PWM4OFCON_OFM1_MASK                      equ 0040h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0E0Fh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 0E10h
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0005h
INTPPS_INTPPS_LENGTH                     equ 0005h
INTPPS_INTPPS_MASK                       equ 001Fh
INTPPS_INTPPS0_POSN                      equ 0000h
INTPPS_INTPPS0_POSITION                  equ 0000h
INTPPS_INTPPS0_SIZE                      equ 0001h
INTPPS_INTPPS0_LENGTH                    equ 0001h
INTPPS_INTPPS0_MASK                      equ 0001h
INTPPS_INTPPS1_POSN                      equ 0001h
INTPPS_INTPPS1_POSITION                  equ 0001h
INTPPS_INTPPS1_SIZE                      equ 0001h
INTPPS_INTPPS1_LENGTH                    equ 0001h
INTPPS_INTPPS1_MASK                      equ 0002h
INTPPS_INTPPS2_POSN                      equ 0002h
INTPPS_INTPPS2_POSITION                  equ 0002h
INTPPS_INTPPS2_SIZE                      equ 0001h
INTPPS_INTPPS2_LENGTH                    equ 0001h
INTPPS_INTPPS2_MASK                      equ 0004h
INTPPS_INTPPS3_POSN                      equ 0003h
INTPPS_INTPPS3_POSITION                  equ 0003h
INTPPS_INTPPS3_SIZE                      equ 0001h
INTPPS_INTPPS3_LENGTH                    equ 0001h
INTPPS_INTPPS3_MASK                      equ 0008h
INTPPS_INTPPS4_POSN                      equ 0004h
INTPPS_INTPPS4_POSITION                  equ 0004h
INTPPS_INTPPS4_SIZE                      equ 0001h
INTPPS_INTPPS4_LENGTH                    equ 0001h
INTPPS_INTPPS4_MASK                      equ 0010h

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0E11h
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0005h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0005h
T0CKIPPS_T0CKIPPS_MASK                   equ 001Fh
T0CKIPPS_T0CKIPPS0_POSN                  equ 0000h
T0CKIPPS_T0CKIPPS0_POSITION              equ 0000h
T0CKIPPS_T0CKIPPS0_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS0_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS0_MASK                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSN                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSITION              equ 0001h
T0CKIPPS_T0CKIPPS1_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS1_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS1_MASK                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSN                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSITION              equ 0002h
T0CKIPPS_T0CKIPPS2_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS2_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS2_MASK                  equ 0004h
T0CKIPPS_T0CKIPPS3_POSN                  equ 0003h
T0CKIPPS_T0CKIPPS3_POSITION              equ 0003h
T0CKIPPS_T0CKIPPS3_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS3_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS3_MASK                  equ 0008h
T0CKIPPS_T0CKIPPS4_POSN                  equ 0004h
T0CKIPPS_T0CKIPPS4_POSITION              equ 0004h
T0CKIPPS_T0CKIPPS4_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS4_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS4_MASK                  equ 0010h

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0E12h
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0005h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0005h
T1CKIPPS_T1CKIPPS_MASK                   equ 001Fh
T1CKIPPS_T1CKIPPS0_POSN                  equ 0000h
T1CKIPPS_T1CKIPPS0_POSITION              equ 0000h
T1CKIPPS_T1CKIPPS0_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS0_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS0_MASK                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSN                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSITION              equ 0001h
T1CKIPPS_T1CKIPPS1_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS1_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS1_MASK                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSN                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSITION              equ 0002h
T1CKIPPS_T1CKIPPS2_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS2_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS2_MASK                  equ 0004h
T1CKIPPS_T1CKIPPS3_POSN                  equ 0003h
T1CKIPPS_T1CKIPPS3_POSITION              equ 0003h
T1CKIPPS_T1CKIPPS3_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS3_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS3_MASK                  equ 0008h
T1CKIPPS_T1CKIPPS4_POSN                  equ 0004h
T1CKIPPS_T1CKIPPS4_POSITION              equ 0004h
T1CKIPPS_T1CKIPPS4_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS4_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS4_MASK                  equ 0010h

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0E13h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0005h
T1GPPS_T1GPPS_LENGTH                     equ 0005h
T1GPPS_T1GPPS_MASK                       equ 001Fh
T1GPPS_T1GPPS0_POSN                      equ 0000h
T1GPPS_T1GPPS0_POSITION                  equ 0000h
T1GPPS_T1GPPS0_SIZE                      equ 0001h
T1GPPS_T1GPPS0_LENGTH                    equ 0001h
T1GPPS_T1GPPS0_MASK                      equ 0001h
T1GPPS_T1GPPS1_POSN                      equ 0001h
T1GPPS_T1GPPS1_POSITION                  equ 0001h
T1GPPS_T1GPPS1_SIZE                      equ 0001h
T1GPPS_T1GPPS1_LENGTH                    equ 0001h
T1GPPS_T1GPPS1_MASK                      equ 0002h
T1GPPS_T1GPPS2_POSN                      equ 0002h
T1GPPS_T1GPPS2_POSITION                  equ 0002h
T1GPPS_T1GPPS2_SIZE                      equ 0001h
T1GPPS_T1GPPS2_LENGTH                    equ 0001h
T1GPPS_T1GPPS2_MASK                      equ 0004h
T1GPPS_T1GPPS3_POSN                      equ 0003h
T1GPPS_T1GPPS3_POSITION                  equ 0003h
T1GPPS_T1GPPS3_SIZE                      equ 0001h
T1GPPS_T1GPPS3_LENGTH                    equ 0001h
T1GPPS_T1GPPS3_MASK                      equ 0008h
T1GPPS_T1GPPS4_POSN                      equ 0004h
T1GPPS_T1GPPS4_POSITION                  equ 0004h
T1GPPS_T1GPPS4_SIZE                      equ 0001h
T1GPPS_T1GPPS4_LENGTH                    equ 0001h
T1GPPS_T1GPPS4_MASK                      equ 0010h

// Register: CWG1INPPS
#define CWG1INPPS CWG1INPPS
CWG1INPPS                                equ 0E14h
// bitfield definitions
CWG1INPPS_CWG1INPPS_POSN                 equ 0000h
CWG1INPPS_CWG1INPPS_POSITION             equ 0000h
CWG1INPPS_CWG1INPPS_SIZE                 equ 0005h
CWG1INPPS_CWG1INPPS_LENGTH               equ 0005h
CWG1INPPS_CWG1INPPS_MASK                 equ 001Fh
CWG1INPPS_CWG1INPPS0_POSN                equ 0000h
CWG1INPPS_CWG1INPPS0_POSITION            equ 0000h
CWG1INPPS_CWG1INPPS0_SIZE                equ 0001h
CWG1INPPS_CWG1INPPS0_LENGTH              equ 0001h
CWG1INPPS_CWG1INPPS0_MASK                equ 0001h
CWG1INPPS_CWG1INPPS1_POSN                equ 0001h
CWG1INPPS_CWG1INPPS1_POSITION            equ 0001h
CWG1INPPS_CWG1INPPS1_SIZE                equ 0001h
CWG1INPPS_CWG1INPPS1_LENGTH              equ 0001h
CWG1INPPS_CWG1INPPS1_MASK                equ 0002h
CWG1INPPS_CWG1INPPS2_POSN                equ 0002h
CWG1INPPS_CWG1INPPS2_POSITION            equ 0002h
CWG1INPPS_CWG1INPPS2_SIZE                equ 0001h
CWG1INPPS_CWG1INPPS2_LENGTH              equ 0001h
CWG1INPPS_CWG1INPPS2_MASK                equ 0004h
CWG1INPPS_CWG1INPPS3_POSN                equ 0003h
CWG1INPPS_CWG1INPPS3_POSITION            equ 0003h
CWG1INPPS_CWG1INPPS3_SIZE                equ 0001h
CWG1INPPS_CWG1INPPS3_LENGTH              equ 0001h
CWG1INPPS_CWG1INPPS3_MASK                equ 0008h
CWG1INPPS_CWG1INPPS4_POSN                equ 0004h
CWG1INPPS_CWG1INPPS4_POSITION            equ 0004h
CWG1INPPS_CWG1INPPS4_SIZE                equ 0001h
CWG1INPPS_CWG1INPPS4_LENGTH              equ 0001h
CWG1INPPS_CWG1INPPS4_MASK                equ 0010h

// Register: RXPPS
#define RXPPS RXPPS
RXPPS                                    equ 0E15h
// bitfield definitions
RXPPS_RXPPS_POSN                         equ 0000h
RXPPS_RXPPS_POSITION                     equ 0000h
RXPPS_RXPPS_SIZE                         equ 0005h
RXPPS_RXPPS_LENGTH                       equ 0005h
RXPPS_RXPPS_MASK                         equ 001Fh
RXPPS_RXPPS0_POSN                        equ 0000h
RXPPS_RXPPS0_POSITION                    equ 0000h
RXPPS_RXPPS0_SIZE                        equ 0001h
RXPPS_RXPPS0_LENGTH                      equ 0001h
RXPPS_RXPPS0_MASK                        equ 0001h
RXPPS_RXPPS1_POSN                        equ 0001h
RXPPS_RXPPS1_POSITION                    equ 0001h
RXPPS_RXPPS1_SIZE                        equ 0001h
RXPPS_RXPPS1_LENGTH                      equ 0001h
RXPPS_RXPPS1_MASK                        equ 0002h
RXPPS_RXPPS2_POSN                        equ 0002h
RXPPS_RXPPS2_POSITION                    equ 0002h
RXPPS_RXPPS2_SIZE                        equ 0001h
RXPPS_RXPPS2_LENGTH                      equ 0001h
RXPPS_RXPPS2_MASK                        equ 0004h
RXPPS_RXPPS3_POSN                        equ 0003h
RXPPS_RXPPS3_POSITION                    equ 0003h
RXPPS_RXPPS3_SIZE                        equ 0001h
RXPPS_RXPPS3_LENGTH                      equ 0001h
RXPPS_RXPPS3_MASK                        equ 0008h
RXPPS_RXPPS4_POSN                        equ 0004h
RXPPS_RXPPS4_POSITION                    equ 0004h
RXPPS_RXPPS4_SIZE                        equ 0001h
RXPPS_RXPPS4_LENGTH                      equ 0001h
RXPPS_RXPPS4_MASK                        equ 0010h

